In [16]:
import pandas as pd
import numpy as np

## 1 [join/merge in pandas](http://pandas.pydata.org/pandas-docs/stable/merging.html)

In [17]:
raw_data = {'subject_id': ['1', '2', '3', '4', '5'],'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [10]:
raw_data = {'subject_id': ['4', '5', '6', '7', '8'],'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
df_b = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])
df_b

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [11]:
raw_data = {'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
            'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}
df_n = pd.DataFrame(raw_data, columns = ['subject_id','test_id'])
df_n

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

In [4]:
df_new = pd.concat([df_a, df_b])
df_new

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [5]:
pd.concat([df_a, df_b], axis=1)

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

In [6]:
pd.merge(df_new, df_n, on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

In [13]:
print (pd.merge(df_a, df_b, on='subject_id', how='right'))
print (pd.merge(df_a, df_b, on='subject_id', how='left'))
print (pd.merge(df_a, df_b, on='subject_id', how='inner'))
print (pd.merge(df_a, df_b, on='subject_id', how='outer'))

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black
2          6          NaN         NaN         Bran     Balwner
3          7          NaN         NaN        Bryce       Brice
4          8          NaN         NaN        Betty      Btisan
  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black
  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan

## 2 [groupby](http://pandas.pydata.org/pandas-docs/stable/groupby.html)

In [18]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],'C' : np.random.randn(8), 'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.863916  1.243817
1  bar    one  1.187879 -0.132252
2  foo    two  0.378974  1.725077
3  bar  three -0.309249  1.709937
4  foo    two -0.043809 -0.407384
5  bar    two -0.897359  0.548919
6  foo    one -0.626213 -0.734612
7  foo  three -0.071553 -0.631069

In [19]:
group=df.groupby('A',as_index=False)#as_index=False is important here
print (group.groups)

{'bar': Int64Index([1, 3, 5], dtype='int64'), 'foo': Int64Index([0, 2, 4, 6, 7], dtype='int64')}

In [21]:
print (group.get_group('bar'))
df.groupby(['A', 'B']).get_group(('bar', 'one'))

     A      B         C         D
1  bar    one  1.187879 -0.132252
3  bar  three -0.309249  1.709937
5  bar    two -0.897359  0.548919

     A    B         C         D
1  bar  one  1.187879 -0.132252

In [22]:
print (group.mean())
#df.groupby(['A', 'B'])

     A         C         D
0  bar -0.006243  0.708868
1  foo  0.100263  0.239166

In [24]:
print (group.aggregate(np.mean))#注意aggregate()里面的function是真的aggregate的np series用的。。
group.aggregate(lambda x: np.mean(x)+1 )

     A         C         D
0  bar -0.006243  0.708868
1  foo  0.100263  0.239166

     A         C         D
0  bar  0.993757  1.708868
1  foo  1.100263  1.239166

In [25]:
group['C'].agg([np.sum, np.mean, np.std])

          sum      mean       std
A
bar -0.018729 -0.006243  1.075134
foo  0.501316  0.100263  0.556527

## 3 pandas query and selection

In [27]:
from numpy.random import randn
from pandas import DataFrame
df = DataFrame(randn(10, 2), columns=list('ab'))
print (df.query('a > 0.2'))
print (df.query('a > b')) 
df[df.a > df.b] 
df[df['a']>0]

          a         b
5  0.960224  0.466036
8  1.735001  0.158580
9  0.629719 -0.276324
          a         b
2 -0.314170 -1.433589
5  0.960224  0.466036
7  0.186396 -0.694132
8  1.735001  0.158580
9  0.629719 -0.276324

          a         b
5  0.960224  0.466036
7  0.186396 -0.694132
8  1.735001  0.158580
9  0.629719 -0.276324

In [30]:
##series is so great, it has keys so you can assign values to change..there is also
import pandas as pd
a=[1,2,3,4,5,6]
b=pd.Series([1,2,3,4,5])
b.values
b[1]='yes'
print (b[4])
b

5

0      1
1    yes
2      3
3      4
4      5
dtype: object